//用来定义一些常规的信息
#ifndef GENERAL_CFG_H
#define GENERAL_CFG_H
//********************************************************************
//第一部分：通信方式的定义
#define		MAX_TRANSMISSION_METHOD			3
enum {	//通信的几种方式
	TRANSMISSION_NET,
	TRANSMISSION_CAN,
	TRANSMISSION_RS485
};
const char sTransmissionName[][32] = {"TCP/IP","CAN","RS-485"};
//第二部分：模块的类型定义
#define		MAX_MODULETYPE_NUM				7		
const char sModuleTypeName[][32] = {"保留模块","键盘模块","输出型继电器模块","输入/出型继电器模块","门卡模块","空调模块","门牌显示模块"};
//第三部分：各个子模块(每个子模块最多有8种)
#define		MAX_SUB_MODULETYPE_NUM			4
//***************************************************************
const char sGolabModuleName[][MAX_SUB_MODULETYPE_NUM][32] = {"","","","",		//保留模块
			"20按键面板","12按键面板","8按键面板","4按键面板",					//键盘模块
			"8路继电器","4路继电器","2路继电器","",								//输出型继电器模块
			"12/8继电器模块","8/4继电器模块","","",											//输入/出型继电器模块
			"门卡","","","",													//门卡模块
			"空调","","","",													//空调模块
			"门牌","","",""														//门牌显示模块
};	

//前字节是输入，后面是输出
const unsigned short gKeyNum[][MAX_SUB_MODULETYPE_NUM] = {0x0000,0x0000,0x0000,0x0000,
									0x1400,0x0C00,0x0800,0x0400,
									0x0008,0x0004,0x0002,0x0000,
									0x0C08,0x0804,0x0000,0x0000,
									0x0000,0x0000,0x0000,0x0000,
									0x0100,0x0000,0x0000,0x0000,
									0x0000,0x0000,0x0000,0x0000
};	
//*********************************************************************
#endif